{
  "nav.home": "Home",
  "nav.about": "About",
  "nav.timeline": "Timeline",
  "nav.knowledge": "Skills",
  "about.greeting": "Hello, world!",
  "brand.name": "ISAM ZAHRIOU",
  "about.intro": "My name is Isam, I was born in Madrid on July 30, 1999 and",
  "about.tech_fascination": "Since I was very young I have been fascinated by computers and exploring what can be done with them, enjoying tinkering and learning by doing. Computers have been part of my life as a learning tool, hobby, and work.",
  "about.education": "After finishing compulsory secondary education I studied a vocational course in Microcomputer Systems and Networks (SMR). I later focused on software development as my career path.",
  "timeline.title": "My journey",
  "timeline.item1.title": "My first computer",
  "timeline.item1.desc": "My parents started a business and needed a computer to keep records. I used every opportunity to use it and learn on my own, which sparked my early interest in computing.",
  "timeline.item2.title": "PRE-ESO",
  "timeline.item2.desc": "During this time I learned how computer components work: how to assemble, maintain and repair them. I built and fixed machines for friends and acquaintances, gaining practical experience.",
  "timeline.item3.title": "Secondary Education",
  "timeline.item3.desc": "I finished secondary education, a period where I consolidated study habits and learned the importance of consistency and discipline to progress in a passion.",
  "timeline.item4.title": "SMR",
  "timeline.item4.desc": "In the vocational program I learned about networks —protocols, IP addressing and basic administration— and systems including virtual machines and filesystems. This work collects part of what I learned. I also got interested in front-end web development and obtained CCNA1 certification.",
  "timeline.item4.link": "This",
  "timeline.item5.title": "Internship at NIMBEO",
  "timeline.item5.desc": "I chose an extended internship and completed 9 months at NIMBEO, a software development company. There I consolidated web development skills and learned AngularJS and jQuery, reinforcing my self-taught approach.",
  "timeline.item6.title": "COBOL Developer at Indra",
  "timeline.item6.desc": "I completed an intensive three-week course studying SQL, COBOL and Linux. Later I participated in a banking project at Indra, developing in COBOL on UNIX. I spent around one year and three months, a formative stage where I learned technical and functional aspects of banking and financial accounting.",
  "timeline.item7.title": "COBOL Migration",
  "timeline.item7.desc": "I participated in the migration from Caixa Geral to ABANCA, supporting teams by resolving doubts and analyzing how processes handled information. I worked with z/OS Mainframe and gained practical experience in JCL and CICS.",
  "timeline.item7.link": "Article about the migration completion",
  "timeline.item8.title": "CFGS DAM ONLINE",
  "timeline.item8.desc": "I combined work with a Higher Degree in Multiplatform Application Development (CFGS DAM), which allowed me to expand my development skills and consolidate practical knowledge.",
  "timeline.item9.title": "DXC Technology",
  "timeline.item9.payments": "Payments",
  "timeline.item9.payments_desc": "Development in COBOL on a complex HP NonStop infrastructure, contributing to implementation and maintenance of payment-related features.",
  "timeline.item9.digitalization": "Document digitalization",
  "timeline.item9.digitalization_desc": "Work on development, analysis and testing of a Java (Spring Boot) application, also collaborating on database tasks.",
  "knowledge.title": "Skills",
  "knowledge.more_info": "Click for more information",
  "knowledge.default": "My skills are constantly growing; I always try to have a project or something to learn in mind. The left panels contain more detailed information.",
  "skill.label.cobol": "COBOL",
  "skill.label.java": "Java",
  "skill.label.cplusplus": "C++",
  "skill.label.sql": "SQL",
  "skill.label.dweb": "Web development",
  "cobol.content": "<p>After finishing my vocational training I discovered <span class=\"font-weight-bold\">COBOL</span>, a language I did not know but that became a great professional opportunity. Although my initial intention was to continue with higher studies, I had to join the job market and COBOL was my entry point. Over time it became a cornerstone of my career and the language that most propelled me professionally.</p><p>In recent years I have worked on <span class=\"font-weight-bold\">HP NonStop</span> systems, developing and maintaining applications in <span class=\"font-weight-bold\">COBOL and SCOBOL</span>, as well as <span class=\"font-weight-bold\">batch</span> processes linked to banking transactions. I have experience in:</p><ul><li>Development and maintenance of COBOL and SCOBOL applications.</li><li>Management of transactions and routines in COBOL environments.</li><li>Batch processes and JOB execution.</li><li>Use of <strong>JCL</strong> in <strong>Mainframe</strong> environments.</li><li>Running and monitoring JOBs on <strong>Linux</strong>.</li><li>Transactional environments on <strong>HP NonStop</strong> systems.</li></ul><p>COBOL shaped how I think and structure code; I later expanded into other languages and technologies.</p>",
  "sql.summary": "I have solid knowledge of <span class=\"font-weight-bold\">SQL and NoSQL</span>, having used them in real environments with large databases. I understand partitioning, indexes and query optimization techniques, as well as designing complex schemas.",
  "sql.tools_intro": "I have worked with different database management tools:",
  "sql.figcaption1": "Oracle - SQLDeveloper",
  "sql.figcaption2": "DB2 - SPUFI",
  "sql.tool.0": "SQL Developer",
  "sql.tool.1": "MySQL Workbench",
  "sql.tool.2": "DBeaver",
  "sql.tool.3": "SQLite (for mobile development)",
  "dweb.frontend": "Front-end",
  "dweb.backend": "Back-end",
  "java.course_title": "Java course (Udemy)",
  "java.course_sub": "I invested many hours in this Udemy course which helped me a lot.",
  "java.course_link": "Course link",
  "typed.strings": ["Software developer","Self-taught","Proactive"],
  "sql.teaching": "I have also taught SQL privately, helping students progress from fundamentals to complex queries.",
  "sql.professional": "Professionally I have worked mainly with <strong>Oracle</strong> and <strong>DB2</strong>, and I also have experience with <strong>MySQL</strong>. I master <strong>PL/SQL</strong> and can develop scripts, stored procedures and functions.",
  "sql.final": "SQL is one of my strengths and has been a constant technology throughout my career.",
  "java.summary_full": "I have solid, up-to-date knowledge of vanilla Java and continually improve my skills.<br>I have more than three years of experience developing applications for CaixaBank using the Spring Boot framework, making use of modules such as:",
  "java.additional": "I have also taught Java privately to more than five students, helping them not only pass their vocational studies but reach advanced levels.",
  "java.opening": "I have solid, up-to-date knowledge of vanilla Java, constantly improving my skills.",
  "java.experience_intro": "I have over three years of experience developing applications for CaixaBank using the Spring Boot framework, using modules such as:",
  "java.module.0": "Spring Data",
  "java.module.1": "Spring Test",
  "java.module.2": "Spring Batch",
  "java.module.3": "Spring Security",
  "java.module.4": "Spring Cache",
  "java.module.5": "Spring Mail",
  "java.module.6": "Spring Apache Kafka",
  "java.teaching": "I have also taught Java privately to more than five students, helping them not only pass their vocational studies but reach advanced levels.",
  "java.features": "I have a deep command of functional interfaces, lambda expressions and the use of Streams, applying them efficiently in real development environments.",
  "java.project_desc": "I have a small project using the JFrame library, developed with IntelliJ IDEA and XAMPP.",
  "java.project_line": "You can find all the code on my <a href=\"https://github.com/conaruisam/Concesionario_Interface-CRUD\" target=\"_blank\" rel=\"noopener noreferrer\">GitHub</a>.",
  "cplusplus.summary": "<span class=\"font-weight-bold\">C++</span> is one of the languages I most enjoy and which motivates me to keep learning. My knowledge has been mainly self-taught via technical forums, official documentation and platforms like <span class=\"font-weight-bold\">Udemy</span>.",
  "cplusplus.learning": "I often consume advanced educational content, especially from channels such as <a href=\"https://www.youtube.com/c/TheChernoProject/videos\" target=\"_blank\" rel=\"noopener noreferrer\">The Cherno</a>, which helped me deepen topics like optimization, memory management and low-level architecture.",
  "cplusplus.tech_intro": "Technically, I have experience in:",
  "cplusplus.li.0": "Object-oriented programming (OOP)",
  "cplusplus.li.1": "Memory management and pointers",
  "cplusplus.li.2": "Use of Smart Pointers",
  "cplusplus.li.3": "Templates and basic metaprogramming",
  "cplusplus.li.4": "STL (Standard Template Library)",
  "cplusplus.li.5": "Efficient data structures",
  "cplusplus.li.6": "Control flow and control structures",
  "cplusplus.li.7": "Design best practices and optimization",
  "cplusplus.ending": "C++ has been key in improving my way of thinking as a programmer, especially in terms of performance and efficient software design",
  "dweb.frontend_p1": "My experience in web development began during vocational training, learning <span class=\"font-weight-bold\">HTML</span>, <span class=\"font-weight-bold\">CSS</span> and fundamentals of <span class=\"font-weight-bold\">JavaScript</span>. During internships I reinforced these skills and learned to work with <span class=\"font-weight-bold\">AngularJS</span>.",
  "dweb.frontend_p2": "Later, during higher studies, I consolidated my JavaScript knowledge and started working with modern frameworks like <span class=\"font-weight-bold\">ReactJS</span>. I also use <span class=\"font-weight-bold\">Bootstrap</span> for responsive design, which is the basis of this site.",
  "dweb.backend_p1": "On the back-end I have mainly worked with <span class=\"font-weight-bold\">COBOL</span> in enterprise environments. I also have experience with <span class=\"font-weight-bold\">Java</span> and microservices, including designing and implementing <span class=\"font-weight-bold\">REST APIs</span>.",
  "dweb.backend_p2": "Thanks to my knowledge of object-oriented design and databases, I can adapt quickly to new technologies and languages like <span class=\"font-weight-bold\">Ruby</span> or <span class=\"font-weight-bold\">PHP</span>."
}
